In [2]:
import pandas as pd

In [3]:
df=pd.read_excel("file_example_XLS_10.xls")
df.index+=1  #to start from 1
len(df)

6

<h1>How to read random rows of file</h1>

In [75]:
df.sample(n=1) # we ca use (random_state=)  to select same rando, sample

   0 First Name Last Name  Gender        Country  Age        Date    Id
4  4   Kathleen    Hanner  Female  United States   25  15/10/2017  3549

<h1>How append Excel file to existing file</h1>

In [67]:
df2=pd.read_excel("Data Refresh Sample Data.xlsx")
df=pd.concat([df,df2]).reset_index(drop = True)
df.to_excel("file_example_XLS_10.xls",index=False)

<h1>How append data to existing file</h1>

In [58]:
df3=pd.DataFrame({
    0:["6"],
    "First Name":["amr"],
    "Last Name":["mohamed"],
     "Gender":["Male"],
    "Country":["Egypt"],
    "Age":[25],
    "Date":["21/5/2016"],
    "Id":["1254"]
     
    })
df=pd.concat([df,df3]).reset_index(drop = True)
df.to_excel("file_example_XLS_10.xls",index=False)

#Any file except Excel , we useing
#df3.to_('file_example_XLS_10.xls', mode='a', index=False, header=False)

C:\Users\seif\AppData\Local\Temp\ipykernel_1792\2254364305.py:14: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df.to_excel("file_example_XLS_10.xls",index=False)

<h1>Aplly custom function</h1>

In [4]:
def age_group(df,index,col):
    if df[col].loc[index]>35:
        return ">35"
    else:
        return "<35"
g=df.groupby(lambda x: age_group(df,x,"Age"))
g.get_group("<35")

   0 First Name  Last Name  Gender        Country  Age        Date    Id
1  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
2  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
4  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
6  6        amr    mohamed    Male          Egypt   25   21/5/2016  1254

<h1>another method</h1>

In [103]:
def condition(x):
    if x>32:
        return ">32"
    else:
        return '<32'
df['Class'] = df['Age'].apply(condition)
df[df.Class==">32"]

   0 First Name Last Name  Gender        Country  Age        Date    Id Class
3  3     Philip      Gent    Male         France   36  21/05/2015  2587   >32
5  5    Nereida   Magwood  Female  United States   58  16/08/2016  2468   >32